#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/wyatt-prod/wyatt-prod/runs/run-ujkZ2Frhdz23kYMs

Waiting for the plan to start...

Terraform v1.0.8
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0cae4c46a79adccf0]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0937172353b68d41a]
module.vpc.aws_egress_only_internet_gateway.this[0]: Refreshing state... [id=eigw-018a9ee08298dc0f2]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0bc9b640d4f6aa949]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0f261c4e9c77ba50d]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-02f9f5e5b9b55029b]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-03950c7320306deea]
module.vpc.aws_route.private_ipv6_egress[0]: Refreshing state... [id=r-rtb-0937172353b68d41a2750132062]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0bc9b640d4f6aa9491080289494]
module.vpc.aws_route.public_internet_gateway_ipv6[0]: Refreshing state... [id=r-rtb-0bc9b640d4f6aa9492750132062]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0025e36c2675ab3a0]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0af5c5daa7c7bb1d0]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.vpc.aws_route.private_ipv6_egress[0] has been deleted
  - resource "aws_route" "private_ipv6_egress" {
      - destination_ipv6_cidr_block = "::/0" -> null
      - egress_only_gateway_id      = "eigw-018a9ee08298dc0f2" -> null
      - id                          = "r-rtb-0937172353b68d41a2750132062" -> null
      - origin                      = "CreateRoute" -> null
      - route_table_id              = "rtb-0937172353b68d41a" -> null
      - state                       = "active" -> null
    }
  # module.vpc.aws_route_table.private[0] has been changed
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0937172353b68d41a"
      ~ route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = "eigw-018a9ee08298dc0f2"
              - gateway_id                 = ""
              - instance_id                = ""
              - ipv6_cidr_block            = "::/0"
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "wyatt-vpc-private"
        }
        # (5 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.s3_bucket.aws_s3_bucket.this[0] will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "wyatt-datalake"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + enabled = true
          + id      = "log"
          + prefix  = "data/"

          + transition {
              + days          = 30
              + storage_class = "INTELLIGENT_TIERING"
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # module.s3_bucket.aws_s3_bucket_public_access_block.this[0] will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

  # module.vpc.aws_route.private_ipv6_egress[0] will be created
  + resource "aws_route" "private_ipv6_egress" {
      + destination_ipv6_cidr_block = "::/0"
      + egress_only_gateway_id      = "eigw-018a9ee08298dc0f2"
      + id                          = (known after apply)
      + instance_id                 = (known after apply)
      + instance_owner_id           = (known after apply)
      + network_interface_id        = (known after apply)
      + origin                      = (known after apply)
      + route_table_id              = "rtb-0937172353b68d41a"
      + state                       = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @wmjones, Action: `pull_request`*